test/all/loops.cfg.dot
digraph "loops" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_68" [label="let sum: Int = 0"];
        "test1_69" [label="let i: Int = 0"];
        "test1_70" [label="while (i < 10)"];
        "test1_71" [label="i = i + 1"];
        "test1_72" [label="sum = sum + i"];
        "test1_73" [label="return sum",style=filled,fillcolor="#66A7DB"];
        "test1_68" -> "test1_69";
        "test1_69" -> "test1_70";
        "test1_70" -> "test1_71";
        "test1_71" -> "test1_72";
        "test1_72" -> "test1_70";
        "test1_70" -> "test1_73";
    }
    subgraph "cluster_test2" {
        label="test2";
        "test2_74" [label="let sum: Int = 0"];
        "test2_75" [label="let i: Int = 0"];
        "test2_76" [label="until (i < 10)"];
        "test2_77" [label="i = i + 1"];
        "test2_78" [label="sum = sum + i"];
        "test2_79" [label="return sum",style=filled,fillcolor="#66A7DB"];
        "test2_74" -> "test2_75";
        "test2_75" -> "test2_76";
        "test2_76" -> "test2_77";
        "test2_77" -> "test2_78";
        "test2_78" -> "test2_76";
        "test2_76" -> "test2_79";
    }
    subgraph "cluster_test3" {
        label="test3";
        "test3_80" [label="let sum: Int = 0"];
        "test3_81" [label="let i: Int = 0"];
        "test3_82" [label="repeat (10)"];
        "test3_83" [label="i = i + 1"];
        "test3_84" [label="sum = sum + i"];
        "test3_85" [label="return sum",style=filled,fillcolor="#66A7DB"];
        "test3_80" -> "test3_81";
        "test3_81" -> "test3_82";
        "test3_82" -> "test3_83";
        "test3_83" -> "test3_84";
        "test3_84" -> "test3_82";
        "test3_82" -> "test3_85";
    }
    subgraph "cluster_test4" {
        label="test4";
        "test4_86" [label="let m: map<Int, Int> = emptyMap()"];
        "test4_87" [label="foreach ((k, v) of m)"];
        "test4_86" -> "test4_87";
        "test4_87" -> "test4_87";
    }
}
